{"metadata":"I am worried about COVID-19 impacting a trip I have scheduled or plan to schedule. Should I buy an Allianz travel protection plan to cover me in case COVID-19 impacts my trip?","text":"COVID-19 is a known and evolving epidemic that is impacting travel worldwide, with continued spread and impacts expected.  Our travel protection plans do not generally cover losses directly or indirectly related to known, foreseeable, or expected events, epidemics, government prohibitions, warnings, or travel advisories, or fear of travel. However, we are pleased to announce the introduction of our Epidemic Coverage Endorsement to certain plans purchased on or after March 6, 2021.  This endorsement adds certain new covered reasons related to epidemics (including COVID-19) to some of our most popular insurance plans.  Please see the below FAQ section on “Epidemic Coverage Endorsement” for more information.  Note, the Epidemic Coverage Endorsement may not be available for all plans or in all jurisdictions.  To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation. Additionally, in response to the ongoing public health and travel crisis, we are temporarily extending certain claims accommodations as follows*: 1. For plans that do not include the Epidemic Coverage Endorsement, we are temporarily accommodating claims for the following:  Emergency medical care for an insured who becomes ill with COVID-19 while on their trip (if your plan includes the Emergency Medical Care benefit) Trip cancellation and trip interruption if an insured, or that insured’s traveling companion or family member, becomes ill with COVID-19 either before or during the insured’s trip (if your plan includes Trip Cancellation or Trip Interruption benefits, as applicable)  2. If an insured or their traveling companion become ill with COVID-19 while on their trip, that insured will not be subject to the Trip Interruption benefit’s five-day maximum limit for additional accommodation and transportation expenses (however, the maximum daily limit for such expenses and the maximum Trip Interruption benefit limit still apply). These temporary accommodations are strictly applicable to COVID-19 and are only available to customers whose plan includes the applicable benefit.  These accommodations apply to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing."}
{"metadata":"Am I covered if I want to cancel my travel plans because I’m afraid to travel due to COVID-19?","text":"No, canceling a trip because you’re afraid to travel due to COVID-19 is generally not covered by our travel protection plans. However, if you’re concerned about traveling during this time, many airlines and other travel suppliers are allowing their customers to change the dates of their travel without change fees. If you change your trip’s dates, we are happy to allow you to move your plan coverage dates to cover a new or rescheduled trip, so long as that trip is scheduled to be completed within 770 days from the plan’s original purchase date.* For terms and details, please see the below FAQ on changing your travel protection plan’s effective dates. This temporary accommodation is strictly applicable to COVID-19.  This accommodation applies to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing."}
{"metadata":"Am I covered if I cancel or interrupt my trip due to COVID-19?","text":"Claims due to known, foreseeable, or expected events, epidemics, government prohibitions, warnings, or travel advisories or fear of travel are generally not covered.  As such, our travel insurance plans do not generally cover trip cancellations or interruptions directly or indirectly related to COVID-19.  However, we are pleased to announce the introduction of our Epidemic Coverage Endorsement to certain plans purchased on or after March 6, 2021.  This endorsement adds certain new covered reasons related to epidemics (including COVID-19) to some of our most popular insurance plans. Please see the below FAQ section on “Epidemic Coverage Endorsement” for more information.  Note, the Epidemic Coverage Endorsement may not be available for all plans or in all jurisdictions.  To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation. Additionally, in response to the ongoing public health and travel crisis, we are temporarily extending certain claims accommodations as follows*: 1. For plans that do not include the Epidemic Coverage Endorsement, we are temporarily accommodating claims for the following:  Emergency medical care for an insured who becomes ill with COVID-19 while on their trip (if your plan includes the Emergency Medical Care benefit) Trip cancellation and trip interruption if an insured, or that insured’s traveling companion or family member, becomes ill with COVID-19 either before or during the insured’s trip (if your plan includes Trip Cancellation or Trip Interruption benefits, as applicable)  2. If an insured or their traveling companion become ill with COVID-19 while on their trip, that insured will not be subject to the Trip Interruption benefit’s five-day maximum limit for additional accommodation and transportation expenses (however, the maximum daily limit for such expenses and the maximum Trip Interruption benefit limit still apply). These temporary accommodations are strictly applicable to COVID-19 and are only available to customers whose plan includes the applicable benefit.  These accommodations apply to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing."}
{"metadata":"What if my travel supplier (e.g. airline, cruise line, tour operator, etc.) cancels a portion or all of my trip due to COVID-19?","text":"Travel supplier cancellations due to COVID-19 are generally not covered under our travel protection plans. However, if your supplier cancels your trip, you may be eligible for a refund directly from your supplier, and we encourage you to contact them for assistance. If you have rescheduled your trip or rebooked a new trip, we are happy to allow you to move your plan coverage dates to cover a new or rescheduled trip, so long as that trip is scheduled to be completed within 770 days from the plan’s original purchase date.*  For terms and details, please see the below FAQ on changing your travel protection plan’s effective dates. Alternatively, if your travel supplier has canceled your trip due to COVID-19, you may be eligible for a refund of the cost of your travel protection plan.*  For terms and details, please see the below FAQ on canceling your plan. These temporary accommodations are strictly applicable to COVID-19.  These accommodations apply to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing."}
{"metadata":"Am I covered if I cancel my travel plans because of a travel ban or other government-imposed restriction on travel related to COVID-19?","text":"No, canceling a trip because of a travel ban or other government-imposed restriction on travel directly or indirectly related to COVID-19 is generally not covered by our travel protection plans. Please note, many airlines and other travel suppliers are allowing their customers to change the dates of their travel without change fees.  If you change your trip’s dates, we are happy to allow you to move your plan coverage dates to cover a new or rescheduled trip, so long as that trip is scheduled to be completed within 770 days from the plan’s original purchase date.* For terms and details, please see the below FAQ on changing your travel protection plan’s effective dates. Alternatively, if your travel supplier has canceled your trip due to COVID-19, you may be eligible for a refund of the cost of your travel protection plan.* For terms and details, please see the below FAQ on canceling your plan. These temporary accommodations are strictly applicable to COVID-19.  These accommodations apply to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing."}
{"metadata":"How do I know if COVID-19 testing and\/or vaccination is required for my destination?","text":"Check our interactive map for the latest information on travel requirements and entry restrictions for international destinations, including COVID-19 testing, vaccination policies, necessary travel documents and quarantine periods. (Content is provided by Sherpa, an affiliated third party). Please keep in mind that travel restrictions change often, so you should check the travel requirements again before you leave for your trip."}
{"metadata":"What should I do if my destination requires proof of travel insurance that covers COVID-19?","text":"If your destination requires proof of travel insurance, we're happy to provide a summary letter that describes your travel insurance plan benefits, also called an Embassy Letter. Click here to request an Embassy Letter (please allow approximately 48 hours for a response). If you’re not sure whether the information provided in the Embassy Letter satisfies the requirements of your destination country, we recommend that you or your travel advisor contact the nearest embassy or consulate of that country to confirm."}
{"metadata":"Can travel insurance cover trip cancellation or interruption if I don't meet the COVID-19 entry requirements for my destination?","text":"Failing to meet a country’s entry requirements, whether for COVID-19 or any other reason, is not a covered reason for trip cancellation or interruption. It’s the responsibility of the traveler to check international entry requirements before booking a trip. Before you book, and before you travel, use our interactive map to see current information on travel requirements and entry restrictions for international destinations, including COVID-19 testing, vaccination policies, necessary travel documents and quarantine periods. (Content is provided by Sherpa, an affiliated third party)."}
{"metadata":"I have an upcoming trip to an area with reported cases of COVID-19. Will I be covered if I cancel my trip?","text":"No, canceling a trip because of an area being affected by COVID-19 is generally not covered by our travel protection plans. However, if you’re concerned about traveling during this time, many airlines and other travel suppliers are allowing their customers to change the dates of their travel without change fees. If you change your trip’s dates, we are happy to allow you to move your plan coverage dates to cover a new or rescheduled trip, so long as that trip is scheduled to be completed within 770 days from the plan’s original purchase date.* For terms and details, please see the below FAQ on changing your travel protection plan’s effective dates. This temporary accommodation is strictly applicable to COVID-19.  This accommodation applies to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing."}
{"metadata":"Am I covered if I cancel or interrupt my trip because the government has issued a travel advisory or warning for my destination due to COVID-19?","text":"Our plans do not generally cover losses directly or indirectly resulting from government-issued travel advisories or warnings related to COVID-19, including those issued by the U.S. Centers for Disease Control and Prevention (CDC) and U.S. Department of State. However, as a temporary accommodation, please note that the accommodations and other coverage for which you are otherwise eligible under your plan continue to apply regardless of any U.S. Centers for Disease Control and Prevention and U.S. Department of State travel alerts regarding COVID-19 that exist on the effective date of our COVID-19 Coverage Alert. For the latest information and updates, please see our COVID-19 Coverage Alert."}
{"metadata":"Can I cancel my travel protection plan and get the cost of my travel protection plan refunded?","text":"You may be eligible to cancel your plan and receive a refund of your plan cost in the following situations:  You generally have 15 days (or more, depending on your plan and state of residence) from the date your plan was purchased to request a refund of the cost of your plan, provided you have not started your trip or initiated a claim. Please note, plan refund rules vary by state and plan purchased, so please see your plan for details. Additionally, for a temporary period, we are offering refunds for the cost of your single-trip travel protection plan if your travel supplier cancels your trip due to COVID-19, as long as no payable claim has been filed under the plan. (This is not available for annual travel insurance plans, which may be canceled any time for a refund of unearned premium.) Refunds must be requested within 770 days of the original plan purchase date.*  To cancel your plan for one of these situations, please call us at the number listed on your plan.  Unless earlier canceled or otherwise ended in accordance with its terms or the accommodations stated here, plans end 770 days after the original plan purchase date.  Plans do not provide any coverage or accommodation for any loss incurred after the plan ends. This temporary accommodation is strictly applicable to COVID-19.  This accommodation applies to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing."}
{"metadata":"If I rebook my trip to a later date, can I change my travel protection plan’s effective dates to cover the rebooked trip?","text":"Yes, you may change your travel protection plan’s effective dates to cover a new or rescheduled trip, as long as that trip is scheduled to be completed within 770 days from the plan’s original purchase date.  Changes can be made at www.allianztravelinsurance.com or by calling the phone number on your plan.  Please note, if you wish to move your plan’s covered trip dates to cover a new or rescheduled trip, you must update your trip dates prior to the departure date of that new or rescheduled trip and prior to any loss for which you seek coverage.*  Additionally, if your trip costs for your new or rescheduled trip are different than the cost of your original trip, you will need to update your plan’s coverage limits accordingly.  Any change in trip cost insured for the new or rescheduled trip may result in a change in premium.  If you update your plan’s trip dates to cover a new or rescheduled trip but do not adjust your limits, the original plan limits will apply to the new or rescheduled trip. Unless earlier canceled or otherwise ended in accordance with its terms or the accommodations stated here, plans end 770 days after the original plan purchase date.  Plans do not provide any coverage or accommodation for any loss incurred after the plan ends. This temporary accommodation is strictly applicable to COVID-19.  This accommodation applies to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing."}
{"metadata":"What are your temporary accommodations for COVID-19?","text":"To learn more about the temporary, specific accommodations we are currently offering, please read our Coverage Alert.  These accommodations apply to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing."}
{"metadata":"Am I covered for trip cancellation due to COVID-19 if I have a Cancel Anytime plan?","text":"Our Cancel Anytime plans provide up to 100% reimbursement of non-refundable, pre-paid trip costs when a trip is canceled for a covered reason, and up to 80% of those costs for most other unforeseen reasons for cancellation. However, our plans do not provide “Cancel For Any Reason” coverage, and coverage under these plans is subject to terms, conditions, and exclusions. Specifically, Cancel Anytime plans generally exclude coverage for losses directly or indirectly resulting from any of the following: known, foreseeable, or expected events, epidemics, and government prohibitions, and certain other causes of loss. As such, losses directly or indirectly resulting from COVID-19 are not generally covered under our Cancel Anytime plans. However, we are pleased to announce the introduction of our Epidemic Coverage Endorsement to certain plans purchased on or after March 6, 2021.  This endorsement adds certain new covered reasons related to epidemics (including COVID-19) to some of our most popular insurance plans.  Please see the below FAQ section on “Epidemic Coverage Endorsement” for more information.  Note, the Epidemic Coverage Endorsement may not be available for all plans or in all jurisdictions.  To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation. Additionally, in response to the ongoing public health and travel crisis, we are temporarily extending certain claims accommodations as follows*: 1. For plans that do not include the Epidemic Coverage Endorsement, we are temporarily accommodating claims for the following:  Emergency medical care for an insured who becomes ill with COVID-19 while on their trip (if your plan includes the Emergency Medical Care benefit) Trip cancellation and trip interruption if an insured, or that insured’s traveling companion or family member, becomes ill with COVID-19 either before or during the insured’s trip (if your plan includes Trip Cancellation or Trip Interruption benefits, as applicable)  2. If an insured or their traveling companion become ill with COVID-19 while on their trip, that insured will not be subject to the Trip Interruption benefit’s five-day maximum limit for additional accommodation and transportation expenses (however, the maximum daily limit for such expenses and the maximum Trip Interruption benefit limit still apply). These temporary accommodations are strictly applicable to COVID-19 and are only available to customers whose plan includes the applicable benefit.  These accommodations apply to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing."}
{"metadata":"Am I covered if I need emergency medical care because I become ill with COVID-19 while on my trip?","text":"Claims due to known, foreseeable, or expected events, epidemics, government prohibitions, warnings, or travel advisories or fear of travel are generally not covered.  As such, our travel insurance plans do not generally cover medical claims directly or indirectly related to COVID-19.  However, we are pleased to announce the introduction of our Epidemic Coverage Endorsement to certain plans purchased on or after March 6, 2021.  This endorsement adds certain new covered reasons related to epidemics (including COVID-19), including related to emergency medical care if you or a traveling companion become ill with COVID-19 while on your trip, to some of our most popular insurance plans. Please see the below FAQ section on “Epidemic Coverage Endorsement” for more information.  Note, the Epidemic Coverage Endorsement may not be available for all plans or in all jurisdictions.  To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation. Additionally, in response to the ongoing public health and travel crisis, we are temporarily extending certain claims accommodations as follows*: 1. For plans that do not include the Epidemic Coverage Endorsement, we are temporarily accommodating claims for the following:  Emergency medical care for an insured who becomes ill with COVID-19 while on their trip (if your plan includes the Emergency Medical Care benefit) Trip cancellation and trip interruption if an insured, or that insured’s traveling companion or family member, becomes ill with COVID-19 either before or during the insured’s trip (if your plan includes Trip Cancellation or Trip Interruption benefits, as applicable)  2. If an insured or their traveling companion become ill with COVID-19 while on their trip, that insured will not be subject to the Trip Interruption benefit’s five-day maximum limit for additional accommodation and transportation expenses (however, the maximum daily limit for such expenses and the maximum Trip Interruption benefit limit still apply). These temporary accommodations are strictly applicable to COVID-19 and are only available to customers whose plan includes the applicable benefit.  These accommodations apply to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing. Please note, the above applies to emergency medical care for insured individuals who become ill with COVID-19 while traveling.  For the elimination of doubt, we do not provide coverage or reimbursement for the cost of COVID-19 testing required for travel, the cost of COVID-19 vaccination, or any other such expenses. We urge any customer who has a medical issue while traveling or needs help to call us.  We are assisting customers 24\/7\/365 who wish to change their travel plans, need travel assistance, or would like to file a claim.  Our assistance team is ready to help all of our customers who need help while traveling, such as locating medical facilities or rebooking transportation.  You can also use our self-service options on this website. We review every claim based on its unique facts and circumstances and are happy to answer any questions you may have."}
{"metadata":"Is a “long-haul” or an ongoing or active case of COVID-19 considered a pre-existing medical condition?","text":"Our plans generally define a pre-existing medical condition as an injury, illness, or medical condition that, within the 120 days prior to and including the purchase date of your travel protection plan:  Caused a person to seek medical examination, diagnosis, care, or treatment by a doctor; Presented symptoms; or Required a person to take medication prescribed by a doctor (unless the condition or symptoms are controlled by that prescription, and the prescription has not changed).  The illness, injury, or medical condition does not need to be formally diagnosed in order to be considered a pre-existing medical condition. If your medical documentation indicates that COVID-19 symptoms\/treatment were present within the 120 day look-back period prior to your insurance purchase, the condition could fall under the definition of a pre-existing medical condition. Please note:  Many plans include a Pre-Existing Medical Condition Exclusion Waiver. If your travel insurance plan includes this Waiver, and you meet the conditions of the Waiver, then this exclusion will not apply to your plan.  One of the conditions to qualify for this Waiver is that you must be medically able to travel on the day you purchased your plan.  As such, if you are not medically able to travel on the day you purchase your plan as a result of “long-haul” or an ongoing or active case of COVID-19, you may not be eligible for this Waiver. Please see your plan documents for details, and learn more about pre-existing medical conditions here."}
{"metadata":"If I was exposed to someone with COVID-19, would Trip Cancellation benefits apply?","text":"Exposure to someone with COVID-19 is not by itself a covered reason under the Trip Cancellation benefit. However, the Trip Cancellation benefit would apply if you or a traveling companion test positive for COVID-19 or you are diagnosed with COVID-19 by your physician.  The Trip Cancellation benefit would also apply if you or your traveling companion are individually-ordered to quarantine as a result of your exposure. Benefits may not cover the full cost of your quarantine and are subject to applicable benefit limits. For information on what qualifies as an “individually-ordered quarantine,” see the FAQ above on what is meant by individually-ordered quarantine. For more information, please refer to the Epidemic Coverage Endorsement within your plan details. Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
{"metadata":"What happens when a traveling companion or I become ill with an epidemic disease such as COVID-19 or is ordered to quarantine?","text":"If you or a traveling companion become ill due to an epidemic disease (such as COVID-19) or are individually-ordered to quarantine, these are covered reasons that could trigger Trip Cancellation or Trip interruption benefits for the insured.  Note, the plan only covers expenses of the insured. Expenses of traveling companions are not covered unless they are also an insured under the plan.  Benefits may not cover the full cost of your quarantine and are subject to applicable benefit limits.  For information on what qualifies as an “individually-ordered quarantine,” see the FAQ below on what is meant by individually-ordered quarantine.  Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
{"metadata":"What is meant by “individually ordered” quarantine?","text":"A quarantine is considered “individually ordered” when these conditions, as specified in the plan, are met: i. The quarantine is specific to you or a traveling companion, meaning that you or a traveling companion must be specifically and individually designated by name in an order or directive to be placed in quarantine due to an epidemic; and ii. The quarantine does not apply generally or broadly (a) to some segment or all of a population, geographical area, building, or vessel (including without limitation shelter-in-place, stay-at-home, safer-at-home, or other similar restriction), or (b) based on to, from, or through where the person is traveling. This condition (ii) applies even if the quarantine order or directive specifically designates you or a traveling companion by name to be quarantined. Example 1: While you are on a cruise, the crew of your cruise ship is checking temperatures of all passengers and you or your traveling companion demonstrate a temperature outside the accepted range, causing you both to be ordered to quarantine while on board. This would qualify as an individually-ordered quarantine. Example 2: While you are on a cruise, the crew of your cruise ship is checking temperatures of all passengers. As a result of a passenger (not part of your traveling party) demonstrating a temperature outside the accepted range, all passengers on the ship are ordered to quarantine while on board. Because this quarantine applies generally or broadly to the population of the entire vessel, this would not qualify as an individually-ordered quarantine. Example 3: While you are on a cruise, the crew of your cruise ship is conducting random COVID-19 testing of passengers.  A passenger who is not part of your traveling party but with whom you have had close contact tests positive for COVID-19.  As a result, you or your traveling companion are ordered to quarantine while on board.  Other passengers who are not close contacts of the ill passenger are allowed to continue freely moving about the ship as normal.  This would qualify as an individually-ordered quarantine. Example 4: You fly to a country that requires all persons entering the country to quarantine for fourteen days prior to being permitted to freely travel in the country.  Because this is a general\/broad quarantine that applies based on the country to which you are traveling, this would not qualify as an individually-ordered quarantine. Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
{"metadata":"Will the new Epidemic Coverage Endorsement meet government requirements for my trip?","text":"Travel requirements vary by country and continue to rapidly shift and evolve.  While we continually monitor and adapt our products and services as best as we can to meet these requirements, and our plans offer robust benefits in an effort to provide products that meet our customers’ needs, we cannot guarantee that a plan will meet the need in all situations. Though it is the insured’s responsibility to comply with the specific country requirements, we can assist in locating this information. Our interactive map shows current information on travel requirements and entry restrictions for international destinations, including COVID-19 testing, vaccination policies, necessary travel documents and quarantine periods. Check your destination’s entry requirements here. (Content is provided by Sherpa, an affiliated third party). We also can provide a summary letter of travel insurance plan benefits, which we informally refer to as an Embassy Letter.  If your destination requires proof of travel insurance, we're happy to provide a summary letter that describes your travel insurance plan benefits, also called an Embassy Letter. Click here to request an Embassy Letter (please allow approximately 48 hours for a response). If it is unclear whether the information provided in the Embassy Letter satisfies the requirements of the destination country, we recommend that you or your travel advisor contact the nearest embassy or consulate of that country to confirm. To the extent you determine the plan you purchased does not meet your needs, contact us so that we can help you find one that does. Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
{"metadata":"If I’m diagnosed with COVID-19 but I’m asymptomatic, would Trip Cancellation benefits apply?","text":"Even if you or a traveling companion are asymptomatic, proof of a positive COVID-19 test or confirmation of a COVID-19 diagnosis by a doctor would be accepted as verification of illness and may be coverable under Trip Cancellation. For more information, please refer to the Epidemic Coverage Endorsement within your plan details. Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
{"metadata":"Is a positive COVID-19 test administered by someone other than a doctor considered sufficient proof of illness?","text":"To confirm COVID-19 illness, we require a physician's diagnosis or confirmation, or the verified record of a positive molecular (e.g. PCR) or antigen COVID-19 test performed by a third party testing service provider."}
{"metadata":"Which types of COVID-19 test results can be accepted as proof of illness?","text":"To confirm COVID-19 illness, we require a physician's diagnosis or confirmation, or the verified record of a positive molecular (e.g. PCR) or antigen COVID-19 test performed by a third party testing service provider."}
{"metadata":"If I believe I’m sick with COVID-19 but my test result is negative, how can I show proof of illness?","text":"If you’re sick but test negative for COVID, a doctor must advise you to cancel your trip before you cancel it. If this isn’t possible, a doctor must examine or consult with you within 72 hours after the cancellation to confirm the decision to cancel."}
{"metadata":"If I’m asymptomatic when I arrive at my destination, and then test positive for COVID-19, would trip interruption benefits apply?","text":"Even if you or a traveling companion are asymptomatic, proof of a positive COVID-19 test would be accepted as verification of illness and may be coverable under Trip Interruption. Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation. Coverage is subject to the plan’s terms, conditions, and exclusions."}
{"metadata":"What happens if I’m denied boarding based on suspicion of COVID-19 illness, but do not test positive and I end up not being ill?","text":"Even if you never test positive or become ill, if you or a traveling companion is denied boarding due to suspicion of COVID-19 illness, and your plan includes the denied boarding covered reason under Trip Interruption or Travel Delay, you may be eligible for coverage under that benefit. The specific expenses that may be covered depends on the benefit and may vary by plan.  Please note, this does not include being denied boarding as a result of your refusal or failure to comply with rules or requirements of entry to your destination.  You may file a claim under multiple benefits, but you may not be paid more than once for the same expense. Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
{"metadata":"If I’m denied boarding due to suspicion of being ill with COVID-19, would travel delay benefits apply?","text":"If you or a traveling companion is denied boarding due to suspicion of COVID-19 illness, and your plan includes the denied boarding covered reason under Trip Interruption or Travel Delay, you may be eligible for coverage under that benefit. The specific expenses that may be covered depends on the benefit and may vary by plan.  Please note, this does not include being denied boarding as a result of your refusal or failure to comply with rules or requirements of entry to your destination. Example 1: The crew of your cruise ship is checking temperatures of all passengers prior to allowing them to reboard following a shore excursion.  You or your traveling companion demonstrate a temperature outside the accepted range, causing you both to be denied boarding.  This may qualify for coverage under the denied boarding covered reason. Example 2: During the process of reboarding a cruise ship after a shore excursion, you are required to fill out a form indicating whether you have attended any gatherings of 50 or more people while off the ship, which the cruise ship has indicated is prohibited for cruise ship passengers.  However, you did not follow that rule and attended a party with more than 50 people during the shore excursion.  You indicated that on the ship’s form, and as a result, you were not allowed to reboard the ship.  This boarding denial would not qualify for coverage under the denied boarding covered reason because you did not follow the travel supplier’s rules and requirements to travel, an express condition of the denied boarding covered reason. Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
{"metadata":"If I contract COVID-19 after starting my trip and must quarantine, would I qualify for both quarantine and interruption benefits?","text":"Being individually ordered to quarantine while on your trip is a covered reason under the Trip Interruption benefit.  However, “Quarantine” is not itself a benefit under the plan that provides any separate coverage from Trip Interruption. For information on what qualifies as an “individually-ordered quarantine,” see the FAQ above on what is meant by individually-ordered quarantine. If you or a traveling companion later become ill with COVID-19 while on your trip, in addition to the Trip Interruption, you may also be eligible for other benefits as well, such as Emergency Medical Care and Emergency Transportation benefits. You may file a claim under multiple benefits, but you may not be paid more than once for the same expense. Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
{"metadata":"Do your insurance plans cover the cost of additional accommodations for an individually-ordered quarantine?","text":"If an insured is individually ordered to quarantine while on their trip, they may be eligible for coverage under the Trip Interruption benefit for expenses incurred for additional accommodations while quarantined.  Benefits may not cover the full cost of quarantine and are subject to applicable benefit limits. For information on what qualifies as an “individually-ordered quarantine,” see the FAQ above on what is meant by individually-ordered quarantine. Additionally, as a temporary accommodation, if you or a traveling companion become ill with COVID-19 while on your trip, you will not be subject to the Trip Interruption benefit’s five-day maximum limit for additional accommodation and transportation expenses (however, the maximum daily limit for such expenses and the maximum Trip Interruption benefit limit still apply).* This temporary accommodation is strictly applicable to COVID-19 and is only available to customers whose plan includes the Trip Interruption benefit.  This accommodation applies to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing. Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
{"metadata":"If I’m diagnosed with COVID-19 and need emergency medical care while traveling, would Emergency Medical Care benefits apply?","text":"If you are diagnosed with an epidemic disease such as COVID-19 or test positive with COVID-19 and require necessary emergency medical care while traveling, then you can be reimbursed for reasonable costs for emergency medical care up to your specific plan’s maximum limit for the Emergency Medical Care benefit. For more information, please refer to the Epidemic Coverage Endorsement within your plan details. Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
{"metadata":"If products including the Epidemic Coverage Endorsement become available in my state before I travel, do I need to buy one of the new products to have any coverage related to COVID-19?","text":"The introduction of the Epidemic Coverage Endorsement does not affect any terms or conditions of existing policies. Accommodations that were applicable to existing policyholders prior to the introduction of the Epidemic Coverage Endorsement products remain applicable to those policyholders, including temporary claims accommodations for customers who become ill with COVID-19. For information on these accommodations, please see our Coverage Alert. Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
{"metadata":"Will your current COVID-19 accommodations be expanded to include the broader coverage that the Epidemic Coverage Endorsement offers?","text":"No, this new coverage is only available under plans containing the Epidemic Coverage Endorsement.  For other plans, our existing temporary accommodations continue to apply, including temporary claims accommodations for customers who become ill with COVID-19.  For information on these accommodations, please see our Coverage Alert. These accommodations apply to plans currently in effect but may not apply to plans purchased in the future, so please refer to our Coverage Alert for the most up to date information before purchasing.  Please note, this answer is specific to products that include the Epidemic Coverage Endorsement and applicable benefit(s) and covered reason(s) described. To see if your plan includes this endorsement, please look for “Epidemic Coverage Endorsement” on your Declarations of Coverage or Letter of Confirmation."}
